app/views/posts/show.html.erb

<p>Posts:</p>
<% @author.posts.each do |post| %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]